* Baseboard

** Dining room

|     raw | buffered | group | x |
|---------+----------+-------+---|
|     3.5 |        5 | g     | x |
|      49 |       50 | h     | x |
|     9.5 |       10 | b     | x |
|      64 |       65 | g     | x |
|     9.5 |       10 | b     | x |
|     9.5 |       12 | a     | x |
|      71 |       72 | a     | x |
|      79 |       90 | b     | x |
|      46 |       50 | e     | x |
|      31 |       36 | a     | x |
|---------+----------+-------+---|
| *total* |      401 |       |   |
   #+TBLFM: $1=34-3.5::$2=vsum(@2..@-1)

** Living room

|     raw | buffered | group | X |
|---------+----------+-------+---|
|      29 |       36 | h     | x |
|      13 |       14 | g     | x |
|     8.5 |       10 | c     | x |
|       9 |        8 | f     | x |
|      19 |     22.5 | d     | x |
|    61.5 |     61.5 | d     | x |
|    42.5 |       45 | f     | x |
|      31 |       31 | f     | x |
|      31 |       33 | h     | x |
|      33 |       34 | e     | x |
|     110 |      110 | c     | x |
|---------+----------+-------+---|
| *total* |      411 |       |   |
   #+TBLFM: $1=32-3.5::$2=vsum(@2..@-1)


** Bathroom hall

| raw | buffered | group |
|-----+----------+-------|
|  63 |       64 | i     |
|  51 |       52 | j     |
|  13 |       14 | j     |
|  22 |       23 | i     |
|  16 |       17 | j     |



** Groups

- a :: 71 + 31 + 9.5 = 120
- b :: 79 + 9.5 + 9.5 = 120
- c :: 110 + 8.5 = 120
- d :: 61.5 + 19 = 84
- e :: 46 + 33 = 84
- f :: 42.5 + 31 + 9 = 84
- g :: 64 + 13 + 3.5 = 84
- h :: 49 + 29 + 31 = 119 = 120
- total :: 4 x 10' ; 4 x 7' = 68'

Hallway:
- i :: 64 + 23 = 87 = 96
- j :: 52 + 17 + 14 = 83 = 96

* Trim
** Windows and doors (3.5")
|            |  raw | buffered | group |
|------------+------+----------+-------|
| front d    | 80.5 |       84 | m     |
| front d    | 80.5 |       84 | n     |
| front d    |   36 |       44 | s-new |
| closet     |   80 |       84 | o     |
| closet     |   80 |       84 | p     |
| closet     |   49 |       57 | e     |
| office     |   82 |       86 | 96    |
| office     |   82 |       86 | 96    |
| office     |   32 |       40 | 96    |
| kitchen    |   83 |       88 | 96    |
| kitchen    |   83 |       88 | 96    |
| kitchen    | 32.5 |       41 | s-new |
|------------+------+----------+-------|
| connie     | 32.5 |       40 | q-new |
| connie     | 32.5 |       40 | r-new |
| connie     | 53.5 |       62 | e     |
| connie     | 53.5 |       62 | 96    |
| front lawn | 45.5 |       54 | q-new |
| front lawn | 45.5 |       54 | r-new |
| front lawn | 46.5 |       55 | g     |
| front lawn | 46.5 |       55 | f     |
|------------+------+----------+-------|
| din arch   |   54 |       63 | f     |
| din arch   |   54 |       63 | g     |
| din arch   |   94 |       99 | a     |
| din arch   |   94 |       99 | b     |
| din arch   |   94 |       99 | c     |
| din arch   |   94 |       99 | d     |
| entry arch |   67 |       75 | 96    |
| entry arch |   67 |       75 | 96    |
| entry arch | 94.5 |      100 | h     |
| entry arch | 94.5 |      100 | j     |
| entry arch | 94.5 |      100 | k     |
| entry arch | 94.5 |      100 | l     |
|------------+------+----------+-------|
| bath       |   28 |       37 |       |
| bath       |   82 |       87 |       |
| bath       |   82 |       87 |       |
| kitchen    |   30 |       39 |       |
| kitchen    |   82 |       87 |       |
| kitchen    |   82 |       87 |       |
| stair      |   30 |       39 |       |
| stair      |   82 |       87 |       |
| stair      |   82 |       87 |       |
| closet     |   22 |       31 |       |
| closet     |   80 |       85 |       |
| closet     |   80 |       85 |       |

** Windows (2.25")

|  raw | buffered | group |
|------+----------+-------|
|   25 |       27 | l     |
|   25 |       27 | m     |
|   77 |       80 | l     |
|   77 |       80 | m     |
|   25 |       27 | n     |
|   25 |       27 | o     |
|   77 |       80 | n     |
|   77 |       80 | o     |
| 29.5 |       32 | p     |
| 29.5 |       32 | q     |
|   77 |       80 | p     |
|   77 |       80 | q     |


** Reworked groups

- a :: 99 = 120
- b :: 99 = 120
- c :: 99 = 120
- d :: 99 = 120 
- e :: 62 + 57 = 119 = 120
- f :: 63 + 55 = 118 = 120
- g :: 63 + 55 = 118 = 120 
- h :: 100 = 120
- i :: 120
- j :: 100 = 120
- k :: 100 = 120
- l :: 100 = 120
- m :: 7
- n :: 7
- o :: 7
- p :: 7
- q :: 54 + 40 = 94 = 96
- r :: 54 + 40 = 94 = 96
- s :: 44 + 41 = 85 = 96

Arches will require: 15 x 8': $276

* Doors

- Height (floor to top corner): 85in
- Width (corner to corner): 39in
- Doors: entry, dining/office x 2, dining/kitchen, office closet, entry
  closet (55in wide)

~1275in or ~108 ft

* Grand Total

| type    | length | cost/ft |   sub |
|---------+--------+---------+-------|
| base    |     90 |    1.55 | 139.5 |
| door    |    108 |    1.40 | 151.2 |
| window  |     70 |    1.40 |   98. |
|---------+--------+---------+-------|
| *total* |        |         | 388.7 |

Minus office
| type    | length | cost/ft |    sub |
|---------+--------+---------+--------|
| base    |     65 |    1.55 | 100.75 |
| door    |     73 |    1.40 |  102.2 |
| window  |     60 |    1.40 |    84. |
|---------+--------+---------+--------|
| *total* |        |         | 286.95 |
#+TBLFM: $2=108-(((170+40)*2)/12)::$4=vsum(@2..@-1)

* Walls

- Kitchen :: 56 high, 165 x 160, really only two walls (126 ft^2) 
- Dining :: 108 high, 165 x 147 (242 ft^2)
- Living :: 108 high, 160 x 170 (256 ft^2)
- Bath :: 57 high, 49 x 65 (45 ft^2)
* Doorway pieces required:

- Entry way sides: 95 x 5.25 (2)
- Entry way top: 67 x 5.25
- Dining room top: 55 x 6.5

Office is covered with pieces in garage; just get one planed to 3/4
- Office sides: 4.5, 4 x 82 (3/4") 
- Office top: 5 x 30 (1")
